DroneBridge/ESP32/main/main.c
/*
 *   This file is part of DroneBridge: https://github.com/DroneBridge/ESP32
 *
 *   Copyright 2018 Wolfgang Christl
 *
 *   Licensed under the Apache License, Version 2.0 (the "License");
 *   you may not use this file except in compliance with the License.
 *   You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 *   Unless required by applicable law or agreed to in writing, software
 *   distributed under the License is distributed on an "AS IS" BASIS,
 *   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 *   See the License for the specific language governing permissions and
 *   limitations under the License.
 *
 */

/***************************************************************************************************************************
 * Standard C Library Headers
 **************************************************************************************************************************/
#include <stdio.h>
#include <string.h>

/***************************************************************************************************************************
 * ESP-IDF System Headers
 **************************************************************************************************************************/
#include <esp_event.h>
#include <esp_log.h>
#include <esp_mac.h>
#include <esp_spiffs.h>
#include <esp_vfs_semihost.h>
#include <esp_wifi.h>
#include <esp_wifi_types.h>
#include <nvs_flash.h>

/***************************************************************************************************************************
 * FreeRTOS Headers
 **************************************************************************************************************************/
#include "freertos/event_groups.h"

/***************************************************************************************************************************
 * LWIP (Lightweight IP) Headers
 **************************************************************************************************************************/
#include <lwip/apps/netbiosns.h>

/***************************************************************************************************************************
 * ESP32 Driver Headers
 **************************************************************************************************************************/
#include <driver/gpio.h>

/***************************************************************************************************************************
 * DroneBridge (DB) API Headers
 **************************************************************************************************************************/
#include "db_ble.h"
#include "db_esp32_control.h"
#include "db_esp_now.h"
#include "db_protocol.h"
#include "db_serial.h"

/***************************************************************************************************************************
 * Networking & Web Server Headers
 **************************************************************************************************************************/
#include "http_server.h"
#include "mdns.h"

/***************************************************************************************************************************
 * Other Project-Specific Headers
 **************************************************************************************************************************/
#include "globals.h"
#include "iot_button.h"
#include "main.h"

#define NVS_NAMESPACE "settings"

/* used to reset ESP to defaults and force restart or to reset the mode to access point mode */
#ifdef CONFIG_IDF_TARGET_ESP32C3
#define DB_RESET_PIN GPIO_NUM_9
#elif CONFIG_IDF_TARGET_ESP32C6
#define DB_RESET_PIN GPIO_NUM_9
#elif CONFIG_IDF_TARGET_ESP32S2
#define DB_RESET_PIN GPIO_NUM_0
#elif CONFIG_IDF_TARGET_ESP32S3
#define DB_RESET_PIN GPIO_NUM_0
#elif CONFIG_IDF_TARGET_ESP32
#define DB_RESET_PIN GPIO_NUM_0
#else
#define DB_RESET_PIN GPIO_NUM_0
#endif

#ifdef CONFIG_DB_OFFICIAL_BOARD_1_X
#define DB_DEFAULT_UART_TX_PIN    GPIO_NUM_5
#define DB_DEFAULT_UART_RX_PIN    GPIO_NUM_4
#define DB_DEFAULT_UART_RTS_PIN   GPIO_NUM_6
#define DB_DEFAULT_UART_CTS_PIN   GPIO_NUM_7
#define DB_DEFAULT_UART_BAUD_RATE 115200
#elif CONFIG_DB_OFFICIAL_BOARD_1_X_C6
#define DB_DEFAULT_UART_TX_PIN    GPIO_NUM_21
#define DB_DEFAULT_UART_RX_PIN    GPIO_NUM_2
#define DB_DEFAULT_UART_RTS_PIN   GPIO_NUM_22
#define DB_DEFAULT_UART_CTS_PIN   GPIO_NUM_23
#define DB_DEFAULT_UART_BAUD_RATE 115200
#elif CONFIG_DB_GENERIC_BOARD
// initially set pins to 0 to allow the start of the system on all boards. User has to set the correct pins
#define DB_DEFAULT_UART_TX_PIN    GPIO_NUM_0
#define DB_DEFAULT_UART_RX_PIN    GPIO_NUM_0
#define DB_DEFAULT_UART_RTS_PIN   GPIO_NUM_0
#define DB_DEFAULT_UART_CTS_PIN   GPIO_NUM_0
#define DB_DEFAULT_UART_BAUD_RATE 57600
#else
// someone fucked up the config - fallback to generic config
#define DB_DEFAULT_UART_TX_PIN    GPIO_NUM_0
#define DB_DEFAULT_UART_RX_PIN    GPIO_NUM_0
#define DB_DEFAULT_UART_RTS_PIN   GPIO_NUM_0
#define DB_DEFAULT_UART_CTS_PIN   GPIO_NUM_0
#define DB_DEFAULT_UART_BAUD_RATE 57600
#endif

static const char *TAG = "DB_ESP32";

/***************************************************************************************************************************
 * Global variables, defined in globals.h
 **************************************************************************************************************************/
QueueHandle_t db_uart_write_queue_global;
QueueHandle_t db_uart_read_queue_global;
uint8_t DB_RADIO_MODE                             = DB_WIFI_MODE_AP;
uint8_t DB_RADIO_MODE_DESIGNATED                  = DB_WIFI_MODE_AP; // initially assign the same value as DB_RADIO_MODE
uint8_t DB_WIFI_SSID[32]                          = "DroneBridge for ESP32";
uint8_t DB_WIFI_PWD[64]                           = "dronebridge";
char DEFAULT_AP_IP[IP4ADDR_STRLEN_MAX]            = "192.168.2.1";
char DB_STATIC_STA_IP[IP4ADDR_STRLEN_MAX]         = "";
char DB_STATIC_STA_IP_GW[IP4ADDR_STRLEN_MAX]      = "";
char DB_STATIC_STA_IP_NETMASK[IP4ADDR_STRLEN_MAX] = "";
char CURRENT_CLIENT_IP[IP4ADDR_STRLEN_MAX]        = "192.168.2.1";
uint8_t DB_WIFI_CHANNEL                           = 6;
uint8_t DB_SERIAL_PROTOCOL                        = DB_SERIAL_PROTOCOL_MAVLINK;
uint8_t DB_DISABLE_RADIO_ARMED                    = false;
uint8_t DB_UART_PIN_TX                            = DB_DEFAULT_UART_TX_PIN;
uint8_t DB_UART_PIN_RX                            = DB_DEFAULT_UART_RX_PIN;
uint8_t DB_UART_PIN_RTS                           = DB_DEFAULT_UART_RTS_PIN;
uint8_t DB_UART_PIN_CTS                           = DB_DEFAULT_UART_CTS_PIN;
uint8_t DB_UART_RTS_THRESH                        = 64;
int32_t DB_UART_BAUD_RATE                         = DB_DEFAULT_UART_BAUD_RATE;
uint16_t DB_TRANS_BUF_SIZE                        = 128;
uint8_t DB_LTM_FRAME_NUM_BUFFER                   = 2;
uint8_t DB_EN_EXT_ANT                             = false;
uint8_t DB_WIFI_EN_GN                             = false;
uint8_t DB_WIFI_IS_OFF                            = false; // keep track if we switched Wi-Fi off already
db_esp_signal_quality_t db_esp_signal_quality     = {
        .air_rssi = -127, .air_noise_floor = -1, .gnd_rssi = -127, .gnd_noise_floor = -1};
wifi_sta_list_t wifi_sta_list = {.num = 0};
uint8_t LOCAL_MAC_ADDRESS[6];
udp_conn_list_t *udp_conn_list;

// Wifi client mode vars
// int WIFI_ESP_MAXIMUM_RETRY = 25;   // max number of retries to connect to the ap before enabling temp. ap mode
static int s_retry_num = 0;
static EventGroupHandle_t s_wifi_event_group;
#define WIFI_CONNECTED_BIT BIT0
#define WIFI_FAIL_BIT      BIT1

esp_netif_t *esp_default_netif;

/***************************************************************************************************************************
 * Private Function Declaration
 **************************************************************************************************************************/
/***************************************************************************************************************************
 * @brief Sets a DNS server for the given network interface.
 *
 * @param netif Pointer to the network interface.
 * @param addr DNS server address (IPv4).
 * @param type DNS type (primary, secondary, or backup).
 * @return esp_err_t ESP_OK on success, or an error code on failure.
 **************************************************************************************************************************/
static esp_err_t db_set_dns_server(esp_netif_t *netif, uint32_t addr, esp_netif_dns_type_t type);

/***************************************************************************************************************************
 * @brief Assigns static IP to ESP32 when in client mode and static IP, GW and netmask are set in config. Stops client DHCP
 * server
 **************************************************************************************************************************/
static void set_client_static_ip();

/***************************************************************************************************************************
 * Devices get added based on IP (check if IP & PORT are already listed) and removed from the UDP broadcast connection
 * based on MAC address
 *
 * @param arg
 * @param event_base
 * @param event_id
 * @param event_data
 **************************************************************************************************************************/
static void wifi_event_handler(void *arg, esp_event_base_t event_base, int32_t event_id, void *event_data);

/***************************************************************************************************************************
 * @brief Starts the mDNS service on the ESP32.
 *
 * This function initializes and starts the mDNS service, allowing the device
 * to be discovered on the local network using a hostname.
 **************************************************************************************************************************/
static void start_mdns_service();

#if CONFIG_WEB_DEPLOY_SEMIHOST
/***************************************************************************************************************************
 * @brief Initializes the semihosting filesystem.
 *
 * Registers the semihosting virtual filesystem (VFS) to mount a host directory
 * to the ESP32's virtual filesystem, enabling file access via the host.
 *
 * @return esp_err_t ESP_OK on success, ESP_FAIL on failure.
 **************************************************************************************************************************/
static esp_err_t init_fs(void);
#endif

