DroneBridge/ESP32/main/main.c
#if CONFIG_WEB_DEPLOY_SF
/***************************************************************************************************************************
 * @brief Initializes the SPIFFS filesystem.
 *
 * This function registers and mounts the SPIFFS filesystem using the
 * configuration specified in `CONFIG_WEB_MOUNT_POINT`. It also logs
 * the filesystem usage after a successful initialization.
 *
 * @return esp_err_t ESP_OK on success, ESP_FAIL on failure.
 **************************************************************************************************************************/
static esp_err_t init_fs(void);
#endif

/***************************************************************************************************************************
 * Launches an access point where ground stations can connect to
 *
 * @param wifi_mode Allows to overwrite an AP mode from traditional WiFi to LR Mode
 **************************************************************************************************************************/
static void db_init_wifi_apmode(int wifi_mode);

/***************************************************************************************************************************
 * @brief Initializes the ESP Wifi client/station mode where we connect to a known access point.
 **************************************************************************************************************************/
static int db_init_wifi_clientmode();

/***************************************************************************************************************************
 * Initialize WiFi for ESP-NOW mode.
 * If someone uses ESP-NOW over WiFi it is because he wants range over everything else.
 * LR mode makes it very inconvenient to change settings but gives the most range. No AP mode since AP will not be
 * visible.
 **************************************************************************************************************************/
static void db_init_wifi_espnow();

/***************************************************************************************************************************
 * Helper function to read a string from the NVS based on a key. Handles errors accordingly and print result to console
 *
 * @param my_handle nvs_handle to use
 * @param key NVS key as string with max length NVS_KEY_NAME_MAX_SIZE-1
 * @param dst Destination for the read value
 **************************************************************************************************************************/
static void db_read_str_nvs(nvs_handle my_handle, char *key, char *dst);

/***************************************************************************************************************************
 * Read stored settings from internal storage including the saved UDP client.
 **************************************************************************************************************************/
static void db_read_settings_nvs();

/***************************************************************************************************************************
 * Callback for a short press (<CONFIG_BUTTON_SHORT_PRESS_TIME_MS) of the reset/boot button.
 * Sets mode to WiFi access point mode with default password "dronebridge" so user can check/change the config
 * @param arg
 **************************************************************************************************************************/
static void short_press_callback(void *arg, void *usr_data);

/***************************************************************************************************************************
 * Callback for a long press (>CONFIG_BUTTON_LONG_PRESS_TIME_MS) of the reset/boot button.
 * Resets all settings to defaults.
 * @param arg
 **************************************************************************************************************************/
static void long_press_callback(void *arg, void *usr_data);

/***************************************************************************************************************************
 * @brief Setup boot button GPIO to reset entire ESP32 settings and to force a reboot of the system
 **************************************************************************************************************************/
static void set_reset_trigger();

/**
 * @brief Configures and enables the RF switch before initializing radio/Wi-Fi.
 *
 * This function performs the following tasks:
 * 1. Checks if the RF switch is configured.
 * 2. Enables the RF switch if required (necessary on some boards).
 * 3. Sets the RF switch according to the user-defined settings.
 *
 * @note This function must be called before initializing the radio or Wi-Fi to ensure proper operation.
 */
static void db_configure_antenna();

/***************************************************************************************************************************
 * Private Function Definition
 **************************************************************************************************************************/
static esp_err_t db_set_dns_server(esp_netif_t *netif, uint32_t addr, esp_netif_dns_type_t type) {
  if (addr && (addr != IPADDR_NONE)) {
    esp_netif_dns_info_t dns;
    dns.ip.u_addr.ip4.addr = addr;
    dns.ip.type            = IPADDR_TYPE_V4;
    ESP_ERROR_CHECK(esp_netif_set_dns_info(netif, type, &dns));
  }
  return ESP_OK;
}

static void set_client_static_ip() {
  if (DB_RADIO_MODE == DB_WIFI_MODE_STA && strlen(DB_STATIC_STA_IP) > 0 && strlen(DB_STATIC_STA_IP_GW) > 0 &&
      strlen(DB_STATIC_STA_IP_NETMASK) > 0) {
    ESP_LOGI(TAG, "Assigning static IP to ESP32: ESP32-IP: %s Gateway: %s Netmask: %s", DB_STATIC_STA_IP,
             DB_STATIC_STA_IP_GW, DB_STATIC_STA_IP_NETMASK);

    if (esp_netif_dhcpc_stop(esp_default_netif) != ESP_OK) {
      ESP_LOGE(TAG, "Failed to stop dhcp client in order to set static IP");
      return;
    }
    esp_netif_ip_info_t ip;
    memset(&ip, 0, sizeof(esp_netif_ip_info_t));
    ip.ip.addr      = ipaddr_addr(DB_STATIC_STA_IP);
    ip.netmask.addr = ipaddr_addr(DB_STATIC_STA_IP_NETMASK);
    ip.gw.addr      = ipaddr_addr(DB_STATIC_STA_IP_GW);
    if (esp_netif_set_ip_info(esp_default_netif, &ip) != ESP_OK) {
      ESP_LOGE(TAG, "Failed to set static ip info");
    }
    ESP_LOGD(TAG, "Success to set static ip: %s, netmask: %s, gw: %s", DB_STATIC_STA_IP, DB_STATIC_STA_IP_NETMASK,
             DB_STATIC_STA_IP_GW);
    ESP_ERROR_CHECK(db_set_dns_server(esp_default_netif, ipaddr_addr(DB_STATIC_STA_IP_GW), ESP_NETIF_DNS_MAIN));
    ESP_ERROR_CHECK(db_set_dns_server(esp_default_netif, ipaddr_addr("0.0.0.0"), ESP_NETIF_DNS_BACKUP));
  } else {
    // no static IP specified let the DHCP assign us one
  }
}

static void wifi_event_handler(void *arg, esp_event_base_t event_base, int32_t event_id, void *event_data) {
  // Wifi access point mode events
  if (event_base == WIFI_EVENT) {
    switch (event_id) {
    case WIFI_EVENT_AP_STACONNECTED: {
      wifi_event_ap_staconnected_t *event = (wifi_event_ap_staconnected_t *)event_data;
      ESP_LOGI(TAG, "WIFI_EVENT - Client connected - station:" MACSTR ", AID=%d", MAC2STR(event->mac), event->aid);
      ESP_ERROR_CHECK_WITHOUT_ABORT(esp_wifi_ap_get_sta_list(&wifi_sta_list)); // update list of connected stations
      break;
    }

    case WIFI_EVENT_AP_STADISCONNECTED: {
      wifi_event_ap_stadisconnected_t *event = (wifi_event_ap_stadisconnected_t *)event_data;
      ESP_LOGI(TAG, "WIFI_EVENT - Client disconnected - station:" MACSTR ", AID=%d", MAC2STR(event->mac), event->aid);
      struct db_udp_client_t db_udp_client;
      memcpy(db_udp_client.mac, event->mac, sizeof(db_udp_client.mac));
      remove_from_known_udp_clients(udp_conn_list, db_udp_client);
      ESP_ERROR_CHECK_WITHOUT_ABORT(esp_wifi_ap_get_sta_list(&wifi_sta_list)); // update list of connected stations
      break;
    }

    case WIFI_EVENT_AP_START:
      ESP_LOGI(TAG, "WIFI_EVENT_AP_START (SSID: %s PASS: %s)", DB_WIFI_SSID, DB_WIFI_PWD);
      break;

    case WIFI_EVENT_AP_STOP:
      ESP_LOGI(TAG, "WIFI_EVENT - AP stopped!");
      break;

    default:
      break;
    }
  } else if (event_base == IP_EVENT) {
    switch (event_id) {
    case IP_EVENT_AP_STAIPASSIGNED: {
      ip_event_ap_staipassigned_t *event = (ip_event_ap_staipassigned_t *)event_data;
      ESP_LOGI(TAG, "IP_EVENT_AP_STAIPASSIGNED - New station IP:" IPSTR, IP2STR(&event->ip));
      ESP_LOGI(TAG, "IP_EVENT_AP_STAIPASSIGNED - MAC: " MACSTR, MAC2STR(event->mac));
      struct db_udp_client_t db_udp_client;
      db_udp_client.udp_client.sin_family      = PF_INET;
      db_udp_client.udp_client.sin_port        = htons(APP_PORT_PROXY_UDP);
      db_udp_client.udp_client.sin_len         = 16;
      db_udp_client.udp_client.sin_addr.s_addr = event->ip.addr;
      memcpy(db_udp_client.mac, event->mac, sizeof(db_udp_client.mac));
      add_to_known_udp_clients(udp_conn_list, db_udp_client, false);
      break;
    }

    default:
      break;
    }
  }

  // Wifi client mode events
  if (event_base == WIFI_EVENT) {
    switch (event_id) {
    case WIFI_EVENT_STA_START:
      ESP_LOGI(TAG, "WIFI_EVENT_STA_START - Wifi Started");
      if (!DB_WIFI_IS_OFF) { // maybe the other task did set it in the meantime
        ESP_ERROR_CHECK_WITHOUT_ABORT(esp_wifi_connect());
      } else {
        ESP_LOGW(TAG, "Did not start Wi-Fi since autopilot told us he is armed (WIFI_EVENT_STA_START)");
      }
      break;

