DroneBridge/ESP32/main/main.c
    case WIFI_EVENT_STA_CONNECTED:
      set_client_static_ip();
      break;

    case WIFI_EVENT_STA_DISCONNECTED:
      ESP_LOGI(TAG, "WIFI_EVENT_STA_DISCONNECTED - Lost connection to access point");
      if (!DB_WIFI_IS_OFF) {
        ESP_ERROR_CHECK_WITHOUT_ABORT(esp_wifi_connect());
        s_retry_num++;
        ESP_LOGI(TAG, "Retry to connect to the AP (%i)", s_retry_num);
      } else {
        ESP_LOGD(TAG, "WIFI_EVENT_STA_DISCONNECTED - did not try to re-connect since WiFi was commanded off");
      }
      break;

    default:
      break;
    }
  } else if (event_base == IP_EVENT) {
    switch (event_id) {
    case IP_EVENT_STA_GOT_IP: {
      ip_event_got_ip_t *event = (ip_event_got_ip_t *)event_data;
      ESP_LOGI(TAG, "IP_EVENT_STA_GOT_IP: " IPSTR, IP2STR(&event->ip_info.ip));
      sprintf(CURRENT_CLIENT_IP, IPSTR, IP2STR(&event->ip_info.ip));
      s_retry_num = 0;
      xEventGroupSetBits(s_wifi_event_group, WIFI_CONNECTED_BIT);
      break;
    }

    default:
      break;
    }
  }
}

static void start_mdns_service() {
  esp_err_t err = mdns_init();
  if (err) {
    printf("MDNS Init failed: %d\n", err);
    return;
  }
  ESP_ERROR_CHECK(mdns_hostname_set("dronebridge"));
  ESP_ERROR_CHECK(mdns_instance_name_set("DroneBridge for ESP32"));

  ESP_ERROR_CHECK(mdns_service_add(NULL, "_http", "_tcp", 80, NULL, 0));
  ESP_ERROR_CHECK(mdns_service_add(NULL, "_db_proxy", "_tcp", APP_PORT_PROXY, NULL, 0));
  ESP_ERROR_CHECK(mdns_service_add(NULL, "_db_comm", "_tcp", APP_PORT_COMM, NULL, 0));
  ESP_ERROR_CHECK(mdns_service_instance_name_set("_http", "_tcp", "DroneBridge for ESP32"));
  ESP_LOGI(TAG, "MDNS Service started!");
}

#if CONFIG_WEB_DEPLOY_SEMIHOST
static esp_err_t init_fs(void) {
  esp_err_t ret = esp_vfs_semihost_register(CONFIG_WEB_MOUNT_POINT, CONFIG_HOST_PATH_TO_MOUNT);
  if (ret != ESP_OK) {
    ESP_LOGE(TAG, "Failed to register semihost driver (%s)!", esp_err_to_name(ret));
    return ESP_FAIL;
  }
  return ESP_OK;
}
#endif

#if CONFIG_WEB_DEPLOY_SF

static esp_err_t init_fs(void) {
  esp_vfs_spiffs_conf_t conf = {
      .base_path = CONFIG_WEB_MOUNT_POINT, .partition_label = NULL, .max_files = 5, .format_if_mount_failed = false};
  esp_err_t ret = esp_vfs_spiffs_register(&conf);

  switch (ret) {
  case ESP_OK:
    break;
  case ESP_FAIL:
    ESP_LOGE(TAG, "Failed to mount or format filesystem");
    return ESP_FAIL;
  case ESP_ERR_NOT_FOUND:
    ESP_LOGE(TAG, "Failed to find SPIFFS partition");
    return ESP_FAIL;
  default:
    ESP_LOGE(TAG, "Failed to initialize SPIFFS (%s)", esp_err_to_name(ret));
    return ESP_FAIL;
  }

  size_t total = 0, used = 0;
  ret = esp_spiffs_info(NULL, &total, &used);

  switch (ret) {
  case ESP_OK:
    ESP_LOGI(TAG, "Filesystem init finished! Partition size: total: %d bytes, used: %d bytes (%i%%)", total, used,
             (used * 100) / total);
    break;
  default:
    ESP_LOGE(TAG, "Failed to get SPIFFS partition information (%s)", esp_err_to_name(ret));
    break;
  }
  return ret;
}

#endif

static void db_init_wifi_apmode(int wifi_mode) {
  ESP_ERROR_CHECK(esp_netif_init());
  ESP_ERROR_CHECK(esp_event_loop_create_default());
  esp_default_netif      = esp_netif_create_default_wifi_ap();
  wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();
  ESP_ERROR_CHECK(esp_wifi_init(&cfg));
  ESP_ERROR_CHECK(esp_event_handler_instance_register(WIFI_EVENT, ESP_EVENT_ANY_ID, &wifi_event_handler, NULL, NULL));

  esp_event_handler_instance_t ap_staipassigned_ip;
  ESP_ERROR_CHECK(esp_event_handler_instance_register(IP_EVENT, IP_EVENT_AP_STAIPASSIGNED, &wifi_event_handler, NULL,
                                                      &ap_staipassigned_ip));

  wifi_config_t wifi_config = {
      .ap = {.ssid            = "DroneBridge_ESP32_Init",
             .ssid_len        = 0,
             .authmode        = WIFI_AUTH_WPA2_PSK,
             .channel         = DB_WIFI_CHANNEL,
             .ssid_hidden     = 0,
             .beacon_interval = 100,
             .max_connection  = 10},
  };
  strncpy((char *)wifi_config.ap.ssid, (char *)DB_WIFI_SSID, 32);
  strncpy((char *)wifi_config.ap.password, (char *)DB_WIFI_PWD, 64);

  ESP_ERROR_CHECK(esp_wifi_set_mode(WIFI_MODE_AP));
  if (wifi_mode == DB_WIFI_MODE_AP_LR) {
    ESP_LOGI(TAG, "Enabling LR Mode on access point. This device will be invisible to non-ESP32 devices!");
    ESP_ERROR_CHECK(esp_wifi_set_protocol(WIFI_IF_AP, WIFI_PROTOCOL_11B | WIFI_PROTOCOL_LR));
  } else {
    ESP_ERROR_CHECK(esp_wifi_set_protocol(WIFI_IF_AP, WIFI_PROTOCOL_11B));
  }
  ESP_ERROR_CHECK(esp_wifi_set_config(WIFI_IF_AP, &wifi_config));
  wifi_country_t wifi_country = {.cc = "US", .schan = 1, .nchan = 13, .policy = WIFI_COUNTRY_POLICY_MANUAL};
  ESP_ERROR_CHECK(esp_wifi_set_country(&wifi_country));
  ESP_ERROR_CHECK(esp_wifi_set_ps(WIFI_PS_NONE));
  ESP_ERROR_CHECK(esp_wifi_start());
  DB_WIFI_IS_OFF = false; // just to be sure, but should not be necessary

  /* Assign IP to ap/gateway */
  esp_netif_ip_info_t ip;
  memset(&ip, 0, sizeof(esp_netif_ip_info_t));
  ip.ip.addr      = ipaddr_addr(DEFAULT_AP_IP);
  ip.netmask.addr = ipaddr_addr("255.255.255.0");
  ip.gw.addr      = ipaddr_addr(DEFAULT_AP_IP);
  ESP_ERROR_CHECK(esp_netif_dhcps_stop(esp_default_netif));
  ESP_ERROR_CHECK(esp_netif_set_ip_info(esp_default_netif, &ip));
  ESP_ERROR_CHECK(esp_netif_dhcps_start(esp_default_netif));

  ESP_ERROR_CHECK(esp_netif_set_hostname(esp_default_netif, "DBESP32"));
  strncpy(CURRENT_CLIENT_IP, DEFAULT_AP_IP, sizeof(CURRENT_CLIENT_IP));
  ESP_ERROR_CHECK(esp_read_mac(LOCAL_MAC_ADDRESS, ESP_MAC_WIFI_SOFTAP));
}

static int db_init_wifi_clientmode() {
  s_wifi_event_group = xEventGroupCreate();
  ESP_ERROR_CHECK(esp_netif_init());
  ESP_ERROR_CHECK(esp_event_loop_create_default());
  esp_default_netif = esp_netif_create_default_wifi_sta();
  assert(esp_default_netif);

  wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();
  ESP_ERROR_CHECK(esp_wifi_init(&cfg));
  esp_event_handler_instance_t instance_any_id;
  esp_event_handler_instance_t instance_got_ip;
  ESP_ERROR_CHECK(
      esp_event_handler_instance_register(WIFI_EVENT, ESP_EVENT_ANY_ID, &wifi_event_handler, NULL, &instance_any_id));
  ESP_ERROR_CHECK(
      esp_event_handler_instance_register(IP_EVENT, IP_EVENT_STA_GOT_IP, &wifi_event_handler, NULL, &instance_got_ip));

  wifi_config_t wifi_config = {
      .sta = {.ssid = "DroneBridge_ESP32_Init", .password = "dronebridge", .threshold.authmode = WIFI_AUTH_WEP},
  };
  strncpy((char *)wifi_config.sta.ssid, (char *)DB_WIFI_SSID, 32);
  strncpy((char *)wifi_config.sta.password, (char *)DB_WIFI_PWD, 64);

  ESP_ERROR_CHECK(esp_wifi_set_mode(WIFI_MODE_STA));
  if (DB_WIFI_EN_GN) {
    // only makes sense if the AP can not do proper N or you do not need range
    ESP_ERROR_CHECK(
        esp_wifi_set_protocol(WIFI_IF_STA, WIFI_PROTOCOL_11B | WIFI_PROTOCOL_11G | WIFI_PROTOCOL_11N | WIFI_PROTOCOL_LR));
  } else {
    ESP_ERROR_CHECK(esp_wifi_set_protocol(WIFI_IF_STA, WIFI_PROTOCOL_11B | WIFI_PROTOCOL_LR)); // range for sure
  }
  ESP_ERROR_CHECK(esp_wifi_set_config(WIFI_IF_STA, &wifi_config));
  ESP_ERROR_CHECK(esp_wifi_set_ps(WIFI_PS_NONE)); // disable power saving
  ESP_ERROR_CHECK(esp_wifi_start());
  DB_WIFI_IS_OFF = false; // just to be sure, but should not be necessary
  // consider connection lost after 1s of no beacon - triggers reconnect via WIFI_EVENT_STA_DISCONNECTED event
  ESP_ERROR_CHECK(esp_wifi_set_inactive_time(WIFI_IF_STA, 3));

  ESP_LOGI(TAG, "Init of WiFi Client-Mode finished. (SSID: %s PASS: %s)", DB_WIFI_SSID, DB_WIFI_PWD);

