DroneBridge/ESP32/main/main.c
  /* Waiting until either the connection is established (WIFI_CONNECTED_BIT) or connection failed for the maximum
   * number of re-tries (WIFI_FAIL_BIT). The bits are set by event_handler() (see above) */
  EventBits_t bits =
      xEventGroupWaitBits(s_wifi_event_group, WIFI_CONNECTED_BIT | WIFI_FAIL_BIT, pdFALSE, pdFALSE, portMAX_DELAY);

  /* xEventGroupWaitBits() returns the bits before the call returned, hence we can test which event actually
   * happened. */
  bool enable_temp_ap_mode = false;
  switch (bits) {
  case WIFI_CONNECTED_BIT:
    ESP_LOGI(TAG, "Connected to ap SSID:%s password:%s", DB_WIFI_SSID, DB_WIFI_PWD);
    break;
  case WIFI_FAIL_BIT:
    ESP_LOGW(TAG, "Failed to connect to SSID:%s, password:%s", DB_WIFI_SSID, DB_WIFI_PWD);
    enable_temp_ap_mode = true;
    break;
  default:
    ESP_LOGE(TAG, "UNEXPECTED WIFI EVENT");
    break;
  }
  if (enable_temp_ap_mode) {
    ESP_LOGW(TAG, "WiFi client mode was not able to connect to the specified access point");
    return -1;
  }

  ESP_LOGI(TAG, "WiFi client mode enabled and connected!");
  ESP_ERROR_CHECK(esp_read_mac(LOCAL_MAC_ADDRESS, ESP_MAC_WIFI_STA));
  return 0;
}

static void db_init_wifi_espnow() {
  ESP_LOGI(TAG, "Setting up Wi-Fi for ESP-NOW");
  ESP_ERROR_CHECK(esp_netif_init());
  ESP_ERROR_CHECK(esp_event_loop_create_default());
  ESP_ERROR_CHECK(esp_wifi_init(&(wifi_init_config_t)WIFI_INIT_CONFIG_DEFAULT()));
  ESP_ERROR_CHECK(esp_wifi_set_storage(WIFI_STORAGE_RAM));
  ESP_ERROR_CHECK(esp_wifi_set_mode(WIFI_MODE_STA));
  ESP_ERROR_CHECK(esp_wifi_set_ps(WIFI_PS_NONE));
  ESP_ERROR_CHECK(esp_wifi_start());
  ESP_ERROR_CHECK(esp_wifi_set_channel(DB_WIFI_CHANNEL, WIFI_SECOND_CHAN_NONE));
  ESP_ERROR_CHECK(esp_wifi_set_protocol(WIFI_IF_STA, WIFI_PROTOCOL_11B | WIFI_PROTOCOL_LR));
  ESP_LOGI(TAG, "Enabled ESP-NOW WiFi Mode! LR Mode is set. This device will be invisible to non-ESP32 devices!");
  ESP_ERROR_CHECK(esp_read_mac(LOCAL_MAC_ADDRESS, ESP_MAC_WIFI_STA));
}

static void db_read_str_nvs(nvs_handle my_handle, char *key, char *dst) {
  if (strlen(key) + 1 > NVS_KEY_NAME_MAX_SIZE)
    ESP_LOGW(TAG, "key %s is longer than %i bytes", key, NVS_KEY_NAME_MAX_SIZE);
  size_t required_size = 0;
  esp_err_t err        = nvs_get_str(my_handle, key, NULL, &required_size);
  if (err == ESP_OK) {
    char *read_nvs_val = malloc(required_size);
    ESP_ERROR_CHECK_WITHOUT_ABORT(nvs_get_str(my_handle, key, read_nvs_val, &required_size));
    memcpy(dst, read_nvs_val, required_size);
    free(read_nvs_val);
    ESP_LOGI(TAG, "\t%s: %s", key, dst);
  } else {
    ESP_LOGW(TAG, "Could not read key %s from NVS", key);
  }
}

static void db_read_settings_nvs() {
  nvs_handle my_handle;
  if (nvs_open(NVS_NAMESPACE, NVS_READONLY, &my_handle) != ESP_OK) {
    ESP_LOGI(TAG, "NVS namespace not found. Erasing flash, init NVS ...");
    nvs_close(my_handle);
    ESP_ERROR_CHECK(nvs_flash_erase());
    ESP_ERROR_CHECK(nvs_flash_init());
    db_write_settings_to_nvs();
  } else {
    ESP_LOGI(TAG, "Reading settings from NVS");

    db_read_str_nvs(my_handle, "ssid", (char *)DB_WIFI_SSID);
    db_read_str_nvs(my_handle, "wifi_pass", (char *)DB_WIFI_PWD);
    db_read_str_nvs(my_handle, "ap_ip", DEFAULT_AP_IP);
    db_read_str_nvs(my_handle, "ip_sta", DB_STATIC_STA_IP);
    db_read_str_nvs(my_handle, "ip_sta_gw", DB_STATIC_STA_IP_GW);
    db_read_str_nvs(my_handle, "ip_sta_netmsk", DB_STATIC_STA_IP_NETMASK);

    ESP_ERROR_CHECK_WITHOUT_ABORT(nvs_get_u8(my_handle, "esp32_mode", &DB_RADIO_MODE));
    ESP_ERROR_CHECK_WITHOUT_ABORT(nvs_get_u8(my_handle, "wifi_chan", &DB_WIFI_CHANNEL));
    ESP_ERROR_CHECK_WITHOUT_ABORT(nvs_get_u8(my_handle, "wifi_en_gn", &DB_WIFI_EN_GN));
    ESP_ERROR_CHECK_WITHOUT_ABORT(nvs_get_u8(my_handle, "ant_use_ext", &DB_EN_EXT_ANT));
    ESP_ERROR_CHECK_WITHOUT_ABORT(nvs_get_i32(my_handle, "baud", &DB_UART_BAUD_RATE));
    ESP_ERROR_CHECK_WITHOUT_ABORT(nvs_get_u8(my_handle, "gpio_tx", &DB_UART_PIN_TX));
    ESP_ERROR_CHECK_WITHOUT_ABORT(nvs_get_u8(my_handle, "gpio_rx", &DB_UART_PIN_RX));
    ESP_ERROR_CHECK_WITHOUT_ABORT(nvs_get_u8(my_handle, "gpio_cts", &DB_UART_PIN_CTS));
    ESP_ERROR_CHECK_WITHOUT_ABORT(nvs_get_u8(my_handle, "gpio_rts", &DB_UART_PIN_RTS));
    ESP_ERROR_CHECK_WITHOUT_ABORT(nvs_get_u8(my_handle, "rts_thresh", &DB_UART_RTS_THRESH));
    ESP_ERROR_CHECK_WITHOUT_ABORT(nvs_get_u8(my_handle, "proto", &DB_SERIAL_PROTOCOL));
    ESP_ERROR_CHECK_WITHOUT_ABORT(nvs_get_u16(my_handle, "trans_pack_size", &DB_TRANS_BUF_SIZE));
    ESP_ERROR_CHECK_WITHOUT_ABORT(nvs_get_u16(my_handle, "serial_timeout", &DB_SERIAL_READ_TIMEOUT_MS));
    ESP_ERROR_CHECK_WITHOUT_ABORT(nvs_get_u8(my_handle, "ltm_per_packet", &DB_LTM_FRAME_NUM_BUFFER));
    ESP_ERROR_CHECK_WITHOUT_ABORT(nvs_get_u8(my_handle, "radio_dis_onarm", &DB_DISABLE_RADIO_ARMED));

    // get saved UDP client - this read might result in an error if no client was saved prev. by the user
    char udp_client_ip_str[INET_ADDRSTRLEN + 6];
    udp_client_ip_str[0] = '\0';
    db_read_str_nvs(my_handle, "udp_client_ip", udp_client_ip_str);
    uint16_t udp_client_port = 0;
    ESP_ERROR_CHECK_WITHOUT_ABORT(nvs_get_u16(my_handle, "udp_client_port", &udp_client_port));

    // close NVM
    nvs_close(my_handle);
    ESP_LOGI(TAG,
             "\tWifi Mode: %i\n\twifi_chan %i\n\twifi_en_gn %i\n\tant_use_ext %i\n\tradio_dis_onarm %i\n\tbaud "
             "%liu\n\tgpio_tx %i\n\tgpio_rx %i\n\tgpio_cts %i\n\t"
             "gpio_rts %i\n\trts_thresh %i\n\tproto %i\n\ttrans_pack_size %i\n\tltm_per_packet %i\n\tserial_timeout %i",
             DB_RADIO_MODE, DB_WIFI_CHANNEL, DB_WIFI_EN_GN, DB_EN_EXT_ANT, DB_DISABLE_RADIO_ARMED, DB_UART_BAUD_RATE,
             DB_UART_PIN_TX, DB_UART_PIN_RX, DB_UART_PIN_CTS, DB_UART_PIN_RTS, DB_UART_RTS_THRESH, DB_SERIAL_PROTOCOL,
             DB_TRANS_BUF_SIZE, DB_LTM_FRAME_NUM_BUFFER, DB_SERIAL_READ_TIMEOUT_MS);
    if (strlen(udp_client_ip_str) > 0 && udp_client_port != 0) {
      // there was a saved UDP client in the NVM - add it to the udp clients list
      ESP_LOGI(TAG, "Adding %s:%i to known UDP clients.", udp_client_ip_str, udp_client_port);
      struct sockaddr_in new_sockaddr;
      memset(&new_sockaddr, 0, sizeof(new_sockaddr));
      new_sockaddr.sin_family = AF_INET;
      inet_pton(AF_INET, udp_client_ip_str, &new_sockaddr.sin_addr);
      new_sockaddr.sin_port                 = htons(udp_client_port);
      struct db_udp_client_t new_udp_client = {
          .udp_client = new_sockaddr, .mac = {0, 0, 0, 0, 0, 0} // dummy MAC
      };
      bool save_to_nvm = false; // no need to save it to NVM again
      add_to_known_udp_clients(udp_conn_list, new_udp_client, save_to_nvm);
    } else {
      // no saved UDP client - do nothing
    }
  }
}

static void short_press_callback(void *arg, void *usr_data) {
  ESP_LOGW(TAG, "Short press detected setting wifi mode to access point with password: dronebridge");
  DB_RADIO_MODE_DESIGNATED =
      DB_WIFI_MODE_AP; // do not directly change DB_RADIO_MODE since it is not safe and constantly processed by other tasks.
                       // Save settings and reboot will assign DB_RADIO_MODE_DESIGNATED to DB_RADIO_MODE.
  strncpy((char *)DB_WIFI_SSID, "DroneBridge for ESP32", sizeof(DB_WIFI_SSID) - 1);
  strncpy((char *)DB_WIFI_PWD, "dronebridge", sizeof(DB_WIFI_PWD) - 1);
  db_write_settings_to_nvs();
  esp_restart();
}

static void long_press_callback(void *arg, void *usr_data) {
  ESP_LOGW(TAG, "Reset triggered via GPIO %i. Resetting settings and rebooting", DB_RESET_PIN);
  DB_RADIO_MODE_DESIGNATED =
      DB_WIFI_MODE_AP; // do not directly change DB_RADIO_MODE since it is not safe and constantly processed by other tasks.
                       // Save settings and reboot will assign DB_RADIO_MODE_DESIGNATED to DB_RADIO_MODE.
  strncpy((char *)DB_WIFI_SSID, "DroneBridge for ESP32", sizeof(DB_WIFI_SSID) - 1);
  strncpy((char *)DB_WIFI_PWD, "dronebridge", sizeof(DB_WIFI_PWD) - 1);
  strncpy(DEFAULT_AP_IP, "192.168.2.1", sizeof(DEFAULT_AP_IP) - 1);
  memset(DB_STATIC_STA_IP, 0, strlen(DB_STATIC_STA_IP));
  memset(DB_STATIC_STA_IP_GW, 0, strlen(DB_STATIC_STA_IP_GW));
  memset(DB_STATIC_STA_IP_NETMASK, 0, strlen(DB_STATIC_STA_IP_NETMASK));
  DB_WIFI_CHANNEL           = 6;
  DB_WIFI_EN_GN             = 0;
  DB_UART_PIN_TX            = DB_DEFAULT_UART_TX_PIN;
  DB_UART_PIN_RX            = DB_DEFAULT_UART_RX_PIN;
  DB_UART_PIN_CTS           = DB_DEFAULT_UART_CTS_PIN;
  DB_UART_PIN_RTS           = DB_DEFAULT_UART_RTS_PIN;
  DB_UART_BAUD_RATE         = DB_DEFAULT_UART_BAUD_RATE;
  DB_SERIAL_PROTOCOL        = DB_SERIAL_PROTOCOL_MAVLINK;
  DB_DISABLE_RADIO_ARMED    = false;
  DB_TRANS_BUF_SIZE         = 128;
  DB_UART_RTS_THRESH        = 64;
  DB_EN_EXT_ANT             = false; // on-board antenna by default
  DB_SERIAL_READ_TIMEOUT_MS = DB_SERIAL_READ_TIMEOUT_MS_DEFAULT;
  db_write_settings_to_nvs();
  esp_restart();
}

static void set_reset_trigger() {
  button_config_t gpio_btn_cfg = {
      .type             = BUTTON_TYPE_GPIO,
      .long_press_time  = CONFIG_BUTTON_LONG_PRESS_TIME_MS,
      .short_press_time = CONFIG_BUTTON_SHORT_PRESS_TIME_MS,
      .gpio_button_config =
          {
              .gpio_num     = DB_RESET_PIN,
              .active_level = 0,
          },
  };
  button_handle_t gpio_btn = iot_button_create(&gpio_btn_cfg);
  if (NULL == gpio_btn) {
    ESP_LOGE(TAG, "Creating reset button failed");
  } else {
    iot_button_register_cb(gpio_btn, BUTTON_SINGLE_CLICK, short_press_callback, NULL);
    iot_button_register_cb(gpio_btn, BUTTON_LONG_PRESS_UP, long_press_callback, NULL);
  }
}

void db_jtag_serial_info_print() {
  uint8_t buffer[512];
  int len = sprintf((char *)buffer,
                    "\tWifi Mode: %i\n\twifi_chan %i\n\twifi_en_gn %i\n\tant_use_ext %i\n\tbaud %liu\n\tgpio_tx "
                    "%i\n\tgpio_rx %i\n\tgpio_cts %i\n\t"
                    "gpio_rts %i\n\trts_thresh %i\n\tproto %i\n\ttrans_pack_size %i\n\tltm_per_packet %i\n\tserial_timeout "
                    "%i\n\tradio_dis_onarm %i\n",
                    DB_RADIO_MODE, DB_WIFI_CHANNEL, DB_WIFI_EN_GN, DB_EN_EXT_ANT, DB_UART_BAUD_RATE, DB_UART_PIN_TX,
                    DB_UART_PIN_RX, DB_UART_PIN_CTS, DB_UART_PIN_RTS, DB_UART_RTS_THRESH, DB_SERIAL_PROTOCOL,
                    DB_TRANS_BUF_SIZE, DB_LTM_FRAME_NUM_BUFFER, DB_SERIAL_READ_TIMEOUT_MS, DB_DISABLE_RADIO_ARMED);
  write_to_serial(buffer, len);
  len = sprintf((char *)buffer, "\tSSID: %s\n", DB_WIFI_SSID);
  write_to_serial(buffer, len);
  len = sprintf((char *)buffer, "\tPassword: %s\n", DB_WIFI_PWD);
  write_to_serial(buffer, len);
  len = sprintf((char *)buffer, "\tAP IP: %s\n", DEFAULT_AP_IP);
  write_to_serial(buffer, len);
  len = sprintf((char *)buffer, "\tStatic IP: %s\n", DB_STATIC_STA_IP);
  write_to_serial(buffer, len);
  len = sprintf((char *)buffer, "\tStatic IP gateway: %s\n", DB_STATIC_STA_IP_GW);
  write_to_serial(buffer, len);
  len = sprintf((char *)buffer, "\tStatic IP netmask: %s\n", DB_STATIC_STA_IP_NETMASK);
  write_to_serial(buffer, len);
  ESP_LOGI(TAG, "Wrote to serial!");
}

static void db_configure_antenna() {
#if defined(CONFIG_DB_HAS_RF_SWITCH) && defined(CONFIG_DB_RF_SWITCH_GPIO) && (CONFIG_DB_RF_SWITCH_GPIO != 0)
#ifdef CONFIG_DB_OFFICIAL_BOARD_1_X_C6
  gpio_set_direction(GPIO_NUM_3, GPIO_MODE_OUTPUT);
  gpio_set_level(GPIO_NUM_3, 0); // set to low to enable RF switching
#endif
  gpio_set_direction(CONFIG_DB_RF_SWITCH_GPIO, GPIO_MODE_OUTPUT);
  gpio_set_level(CONFIG_DB_RF_SWITCH_GPIO, DB_EN_EXT_ANT); // set level to enable external/internal antenna
  ESP_LOGI(TAG, "External antenna usage: %i", DB_EN_EXT_ANT);
#endif
}

/***************************************************************************************************************************
 * Main Entry Point
 **************************************************************************************************************************/
void app_main() {
  udp_conn_list = udp_client_list_create(); // http server functions and db_read_settings_nvs expect the list to exist
  esp_err_t ret = nvs_flash_init();
  if (ret == ESP_ERR_NVS_NO_FREE_PAGES) {
    ESP_ERROR_CHECK(nvs_flash_erase());
    ret = nvs_flash_init();
  }
  ESP_ERROR_CHECK(ret);
  db_read_settings_nvs();
  DB_RADIO_MODE_DESIGNATED =
      DB_RADIO_MODE; /* must always match, mismatch only allowed when changed by user action and not rebooted, yet. */
  set_reset_trigger();
  db_configure_antenna();

  switch (DB_RADIO_MODE) {

    /* Wi-Fi Access Point mode*/
  case DB_WIFI_MODE_AP:
  case DB_WIFI_MODE_AP_LR:
    db_init_wifi_apmode(DB_RADIO_MODE);
    break;

