DroneBridge/ESP32/main/main.c
    /* ESP-NOW Mode*/
  case DB_WIFI_MODE_ESPNOW_AIR:
  case DB_WIFI_MODE_ESPNOW_GND:
    db_init_wifi_espnow();
    db_start_espnow_module();
    break;

    /* Ble SPP Mode*/
  case DB_BLUETOOTH_MODE_SPP:
    db_init_wifi_apmode(DB_RADIO_MODE);
    db_uart_write_queue_global = xQueueCreate(5, sizeof(BleData_t));
    db_uart_read_queue_global  = xQueueCreate(5, sizeof(BleData_t));
    if (db_uart_write_queue_global == NULL) {
      ESP_LOGI(TAG, "Failed to create queue, you are on your own, KABOOM!");
      return;
    }
    if (db_uart_read_queue_global == NULL) {
      ESP_LOGI(TAG, "Failed to create another queue, you are definately on your own, KABOOM! KABOOM!");
      return;
    }
    db_init_ble();
    break;

    /* Wi-Fi Client Mode*/
  default:
    // Wi-Fi client mode with LR mode enabled
    if (db_init_wifi_clientmode() < 0) {
      ESP_LOGE(TAG, "Failed to init Wifi Client Mode");
    }
    break;
  }

  switch (DB_RADIO_MODE) {
  case DB_WIFI_MODE_ESPNOW_AIR:
  case DB_WIFI_MODE_ESPNOW_GND:
    // no need to start these services - won`t be available anyway - save the resources
    break;
  default:
    start_mdns_service();
    netbiosns_init();
    netbiosns_set_name("dronebridge");
    break;
  }

  ESP_ERROR_CHECK(init_fs());
  db_start_control_module();

  switch (DB_RADIO_MODE) {
  case DB_WIFI_MODE_ESPNOW_AIR:
  case DB_WIFI_MODE_ESPNOW_GND:
    // no need to start these services - won`t be available anyway - save the resources
    break;
  default:
    ESP_ERROR_CHECK(start_rest_server(CONFIG_WEB_MOUNT_POINT));
    ESP_LOGI(TAG, "Rest Server started");
    // Disable legacy support for DroneBridge communication module - no use case for DroneBridge for ESP32
    //   communication_module();
    break;
  }
  ESP_LOGI(TAG, "app_main finished initial setup");
}

/***************************************************************************************************************************
 * Public Function Definition
 **************************************************************************************************************************/

void db_set_wifi_status(uint8_t enable_wifi) {
  // check if that feature is enabled by the user
  if (!DB_DISABLE_RADIO_ARMED) {
    return;
  }

  if (enable_wifi && DB_WIFI_IS_OFF) {
    ESP_LOGI(TAG, "Rebooting ESP32 to re-enable Wi-Fi");
    esp_restart(); // enable Wi-Fi by restarting ESP32 - easy way to make sure all things are set up right
  } else if (!enable_wifi && !DB_WIFI_IS_OFF) {
    ESP_LOGI(TAG, "Disabling Wi-Fi");
    if (esp_wifi_stop() == ESP_OK) { // disable WiFi
      DB_WIFI_IS_OFF = true;
    } else {
      ESP_LOGW(TAG, "db_set_wifi_status tried to disable Wi-Fi. FAILED");
    }
  }
}

void db_write_settings_to_nvs() {
  ESP_LOGI(TAG,
           "Trying to save:\nWifi Mode: %i\nssid %s\nwifi_pass %s\nwifi_chan %i\nwifi_en_gn %i\nbaud %liu\ngpio_tx "
           "%i\ngpio_rx %i\ngpio_cts %i\ngpio_rts %i\nrts_thresh %i\nproto %i\n"
           "trans_pack_size %i\nltm_per_packet %i\nap_ip %s\nip_sta %s\nip_sta_gw %s\nip_sta_netmsk %s\nradio_dis_onarm %i",
           DB_RADIO_MODE_DESIGNATED, DB_WIFI_SSID, DB_WIFI_PWD, DB_WIFI_CHANNEL, DB_WIFI_EN_GN, DB_UART_BAUD_RATE,
           DB_UART_PIN_TX, DB_UART_PIN_RX, DB_UART_PIN_CTS, DB_UART_PIN_RTS, DB_UART_RTS_THRESH, DB_SERIAL_PROTOCOL,
           DB_TRANS_BUF_SIZE, DB_LTM_FRAME_NUM_BUFFER, DEFAULT_AP_IP, DB_STATIC_STA_IP, DB_STATIC_STA_IP_GW,
           DB_STATIC_STA_IP_NETMASK, DB_DISABLE_RADIO_ARMED);
  ESP_LOGI(TAG, "Saving to NVS %s", NVS_NAMESPACE);

  nvs_handle my_handle;

  /* Open NVS and store the configurations */
  ESP_ERROR_CHECK(nvs_open(NVS_NAMESPACE, NVS_READWRITE, &my_handle));
  ESP_ERROR_CHECK(
      nvs_set_u8(my_handle, "esp32_mode", DB_RADIO_MODE_DESIGNATED)); // only DB_RADIO_MODE_DESIGNATED gets updated by user
  ESP_ERROR_CHECK(nvs_set_str(my_handle, "ssid", (char *)DB_WIFI_SSID));
  ESP_ERROR_CHECK(nvs_set_str(my_handle, "wifi_pass", (char *)DB_WIFI_PWD));
  ESP_ERROR_CHECK(nvs_set_u8(my_handle, "wifi_chan", DB_WIFI_CHANNEL));
  ESP_ERROR_CHECK(nvs_set_u8(my_handle, "wifi_en_gn", DB_WIFI_EN_GN));
  ESP_ERROR_CHECK(nvs_set_u8(my_handle, "ant_use_ext", DB_EN_EXT_ANT));
  ESP_ERROR_CHECK(nvs_set_i32(my_handle, "baud", DB_UART_BAUD_RATE));
  ESP_ERROR_CHECK(nvs_set_u8(my_handle, "gpio_tx", DB_UART_PIN_TX));
  ESP_ERROR_CHECK(nvs_set_u8(my_handle, "gpio_rx", DB_UART_PIN_RX));
  ESP_ERROR_CHECK(nvs_set_u8(my_handle, "gpio_cts", DB_UART_PIN_CTS));
  ESP_ERROR_CHECK(nvs_set_u8(my_handle, "gpio_rts", DB_UART_PIN_RTS));
  ESP_ERROR_CHECK(nvs_set_u8(my_handle, "rts_thresh", DB_UART_RTS_THRESH));
  ESP_ERROR_CHECK(nvs_set_u8(my_handle, "proto", DB_SERIAL_PROTOCOL));
  ESP_ERROR_CHECK(nvs_set_u16(my_handle, "trans_pack_size", DB_TRANS_BUF_SIZE));
  ESP_ERROR_CHECK(nvs_set_u16(my_handle, "serial_timeout", DB_SERIAL_READ_TIMEOUT_MS));
  ESP_ERROR_CHECK(nvs_set_u8(my_handle, "ltm_per_packet", DB_LTM_FRAME_NUM_BUFFER));
  ESP_ERROR_CHECK(nvs_set_u8(my_handle, "radio_dis_onarm", DB_DISABLE_RADIO_ARMED));
  ESP_ERROR_CHECK(nvs_set_str(my_handle, "ap_ip", DEFAULT_AP_IP));
  ESP_ERROR_CHECK(nvs_set_str(my_handle, "ip_sta", DB_STATIC_STA_IP));
  ESP_ERROR_CHECK(nvs_set_str(my_handle, "ip_sta_gw", DB_STATIC_STA_IP_GW));
  ESP_ERROR_CHECK(nvs_set_str(my_handle, "ip_sta_netmsk", DB_STATIC_STA_IP_NETMASK));

  /* Commit the changes to NVS*/
  ESP_ERROR_CHECK(nvs_commit(my_handle));

  /* Close NVS */
  nvs_close(my_handle);
}

void save_udp_client_to_nvm(struct db_udp_client_t *new_db_udp_client, bool clear_client) {
  char ip[INET_ADDRSTRLEN];
  uint16_t port;
  if (!clear_client) {
    // convert addr to string
    char client_str[INET_ADDRSTRLEN + 6];
    inet_ntop(AF_INET, &(new_db_udp_client->udp_client.sin_addr), ip, INET_ADDRSTRLEN);
    port = ntohs(new_db_udp_client->udp_client.sin_port);
    snprintf(client_str, sizeof(client_str), "%s:%d", ip, port);
    ESP_LOGI(TAG, "Saving UDP client %s to NVS %s", client_str, NVS_NAMESPACE);
  } else {
    // clear client from NVM by setting string to empty "" and port to 0
    ip[0] = '\0';
    port  = 0;
    ESP_LOGI(TAG, "Clearing UDP client from NVM");
  }

  nvs_handle my_handle;
  ESP_ERROR_CHECK(nvs_open(NVS_NAMESPACE, NVS_READWRITE, &my_handle));
  ESP_ERROR_CHECK(nvs_set_str(my_handle, "udp_client_ip", ip));
  ESP_ERROR_CHECK(nvs_set_u16(my_handle, "udp_client_port", port));

  ESP_ERROR_CHECK(nvs_commit(my_handle));
  nvs_close(my_handle);
}